dinkdeng/RL78_Board_IAR/IAR/Common/ior5f100lg.h
__sfr __no_init volatile union
{
  unsigned char LVIM;
  __BITS8       LVIM_bit;
  struct
  {
    unsigned char  LVIF:1;
    unsigned char  LVIOMSK:1;
    unsigned char  :5;
    unsigned char  LVISEN:1;
  };
} @ 0xFFFA9;

__sfr __no_init volatile union
{
  unsigned char LVIS;
  __BITS8       LVIS_bit;
  struct
  {
    unsigned char  LVILV:1;
    unsigned char  :6;
    unsigned char  LVIMD:1;
  };
} @ 0xFFFAA;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char WDTE;
  __BITS8       WDTE_bit;
} @ 0xFFFAB;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char CRCIN;
  __BITS8       CRCIN_bit;
} @ 0xFFFAC;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char DSA0;
  __BITS8       DSA0_bit;
} @ 0xFFFB0;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char DSA1;
  __BITS8       DSA1_bit;
} @ 0xFFFB1;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short DRA0;
  __BITS16       DRA0_bit;
  struct
  {
    union
    {
      unsigned char DRA0L;
      __BITS8       DRA0L_bit;
    };
    union
    {
      unsigned char DRA0H;
      __BITS8       DRA0H_bit;
    };
  };
} @ 0xFFFB2;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short DRA1;
  __BITS16       DRA1_bit;
  struct
  {
    union
    {
      unsigned char DRA1L;
      __BITS8       DRA1L_bit;
    };
    union
    {
      unsigned char DRA1H;
      __BITS8       DRA1H_bit;
    };
  };
} @ 0xFFFB4;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short DBC0;
  __BITS16       DBC0_bit;
  struct
  {
    union
    {
      unsigned char DBC0L;
      __BITS8       DBC0L_bit;
    };
    union
    {
      unsigned char DBC0H;
      __BITS8       DBC0H_bit;
    };
  };
} @ 0xFFFB6;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short DBC1;
  __BITS16       DBC1_bit;
  struct
  {
    union
    {
      unsigned char DBC1L;
      __BITS8       DBC1L_bit;
    };
    union
    {
      unsigned char DBC1H;
      __BITS8       DBC1H_bit;
    };
  };
} @ 0xFFFB8;

__sfr __no_init volatile union
{
  unsigned char DMC0;
  __BITS8       DMC0_bit;
  struct
  {
    unsigned char  :4;
    unsigned char  DWAIT0:1;
    unsigned char  DS0:1;
    unsigned char  DRS0:1;
    unsigned char  STG0:1;
  };
} @ 0xFFFBA;

__sfr __no_init volatile union
{
  unsigned char DMC1;
  __BITS8       DMC1_bit;
  struct
  {
    unsigned char  :4;
    unsigned char  DWAIT1:1;
    unsigned char  DS1:1;
    unsigned char  DRS1:1;
    unsigned char  STG1:1;
  };
} @ 0xFFFBB;

__sfr __no_init volatile union
{
  unsigned char DRC0;
  __BITS8       DRC0_bit;
  struct
  {
    unsigned char  DST0:1;
    unsigned char  :6;
    unsigned char  DEN0:1;
  };
} @ 0xFFFBC;

__sfr __no_init volatile union
{
  unsigned char DRC1;
  __BITS8       DRC1_bit;
  struct
  {
    unsigned char  DST1:1;
    unsigned char  :6;
    unsigned char  DEN1:1;
  };
} @ 0xFFFBD;

__sfr __no_init volatile union
{
  unsigned short IF2;
  __BITS16       IF2_bit;
  struct
  {
    union
    {
      unsigned char IF2L;
      __BITS8       IF2L_bit;
      struct
      {
        unsigned char  TMIF05:1;
        unsigned char  TMIF06:1;
        unsigned char  TMIF07:1;
        unsigned char  PIF6:1;
        unsigned char  PIF7:1;
        unsigned char  PIF8:1;
        unsigned char  PIF9:1;
        unsigned char  PIF10:1;
      };
    };
    union
    {
      unsigned char IF2H;
      __BITS8       IF2H_bit;
      struct
      {
        unsigned char  PIF11:1;
        unsigned char  :4;
        unsigned char  MDIF:1;
        unsigned char  :1;
        unsigned char  FLIF:1;
      };
    };
  };
} @ 0xFFFD0;

__sfr __no_init volatile union
{
  unsigned short MK2;
  __BITS16       MK2_bit;
  struct
  {
    union
    {
      unsigned char MK2L;
      __BITS8       MK2L_bit;
      struct
      {
        unsigned char  TMMK05:1;
        unsigned char  TMMK06:1;
        unsigned char  TMMK07:1;
        unsigned char  PMK6:1;
        unsigned char  PMK7:1;
        unsigned char  PMK8:1;
        unsigned char  PMK9:1;
        unsigned char  PMK10:1;
      };
    };
    union
    {
      unsigned char MK2H;
      __BITS8       MK2H_bit;
      struct
      {
        unsigned char  PMK11:1;
        unsigned char  :4;
        unsigned char  MDMK:1;
        unsigned char  :1;
        unsigned char  FLMK:1;
      };
    };
  };
} @ 0xFFFD4;

__sfr __no_init volatile union
{
  unsigned short PR02;
  __BITS16       PR02_bit;
  struct
  {
    union
    {
      unsigned char PR02L;
      __BITS8       PR02L_bit;
      struct
      {
        unsigned char  TMPR005:1;
        unsigned char  TMPR006:1;
        unsigned char  TMPR007:1;
        unsigned char  PPR06:1;
        unsigned char  PPR07:1;
        unsigned char  PPR08:1;
        unsigned char  PPR09:1;
        unsigned char  PPR010:1;
      };
    };
    union
    {
      unsigned char PR02H;
      __BITS8       PR02H_bit;
      struct
      {
        unsigned char  PPR011:1;
        unsigned char  :4;
        unsigned char  MDPR0:1;
        unsigned char  :1;
        unsigned char  FLPR0:1;
      };
    };
  };
} @ 0xFFFD8;

__sfr __no_init volatile union
{
  unsigned short PR12;
  __BITS16       PR12_bit;
  struct
  {
    union
    {
      unsigned char PR12L;
      __BITS8       PR12L_bit;
      struct
      {
        unsigned char  TMPR105:1;
        unsigned char  TMPR106:1;
        unsigned char  TMPR107:1;
        unsigned char  PPR16:1;
        unsigned char  PPR17:1;
        unsigned char  PPR18:1;
        unsigned char  PPR19:1;
        unsigned char  PPR110:1;
      };
    };
    union
    {
      unsigned char PR12H;
      __BITS8       PR12H_bit;
      struct
      {
        unsigned char  PPR111:1;
        unsigned char  :4;
        unsigned char  MDPR1:1;
        unsigned char  :1;
        unsigned char  FLPR1:1;
      };
    };
  };
} @ 0xFFFDC;

__sfr __no_init volatile union
{
  unsigned short IF0;
  __BITS16       IF0_bit;
  struct
  {
    union
    {
      unsigned char IF0L;
      __BITS8       IF0L_bit;
      struct
      {
        unsigned char  WDTIIF:1;
        unsigned char  LVIIF:1;
        unsigned char  PIF0:1;
        unsigned char  PIF1:1;
        unsigned char  PIF2:1;
        unsigned char  PIF3:1;
        unsigned char  PIF4:1;
        unsigned char  PIF5:1;
      };
    };
    union
    {
      unsigned char IF0H;
      __BITS8       IF0H_bit;
      struct
      {
        unsigned char  CSIIF20:1;
        unsigned char  CSIIF21:1;
        unsigned char  SREIF2:1;
        unsigned char  DMAIF0:1;
        unsigned char  DMAIF1:1;
        unsigned char  CSIIF00:1;
        unsigned char  CSIIF01:1;
        unsigned char  SREIF0:1;
      };
      struct
      {
        unsigned char  IICIF20:1;
        unsigned char  IICIF21:1;
        unsigned char  :3;
        unsigned char  IICIF00:1;
        unsigned char  IICIF01:1;
        unsigned char  TMIF01H:1;
      };
      struct
      {
        unsigned char  STIF2:1;
        unsigned char  SRIF2:1;
        unsigned char  :3;
        unsigned char  STIF0:1;
        unsigned char  SRIF0:1;
        unsigned char  :1;
      };
    };
  };
} @ 0xFFFE0;

