dinkdeng/RL78_Board_IAR/IAR/Common/ior5f100lg.h
__sfr __no_init volatile union
{
  unsigned short IF1;
  __BITS16       IF1_bit;
  struct
  {
    union
    {
      unsigned char IF1L;
      __BITS8       IF1L_bit;
      struct
      {
        unsigned char  CSIIF10:1;
        unsigned char  CSIIF11:1;
        unsigned char  SREIF1:1;
        unsigned char  IICAIF0:1;
        unsigned char  TMIF00:1;
        unsigned char  TMIF01:1;
        unsigned char  TMIF02:1;
        unsigned char  TMIF03:1;
      };
      struct
      {
        unsigned char  IICIF10:1;
        unsigned char  IICIF11:1;
        unsigned char  TMIF03H:1;
        unsigned char  :5;
      };
      struct
      {
        unsigned char  STIF1:1;
        unsigned char  SRIF1:1;
        unsigned char  :6;
      };
    };
    union
    {
      unsigned char IF1H;
      __BITS8       IF1H_bit;
      struct
      {
        unsigned char  ADIF:1;
        unsigned char  RTCIF:1;
        unsigned char  ITIF:1;
        unsigned char  KRIF:1;
        unsigned char  :3;
        unsigned char  TMIF04:1;
      };
    };
  };
} @ 0xFFFE2;

__sfr __no_init volatile union
{
  unsigned short MK0;
  __BITS16       MK0_bit;
  struct
  {
    union
    {
      unsigned char MK0L;
      __BITS8       MK0L_bit;
      struct
      {
        unsigned char  WDTIMK:1;
        unsigned char  LVIMK:1;
        unsigned char  PMK0:1;
        unsigned char  PMK1:1;
        unsigned char  PMK2:1;
        unsigned char  PMK3:1;
        unsigned char  PMK4:1;
        unsigned char  PMK5:1;
      };
    };
    union
    {
      unsigned char MK0H;
      __BITS8       MK0H_bit;
      struct
      {
        unsigned char  CSIMK20:1;
        unsigned char  CSIMK21:1;
        unsigned char  SREMK2:1;
        unsigned char  DMAMK0:1;
        unsigned char  DMAMK1:1;
        unsigned char  CSIMK00:1;
        unsigned char  CSIMK01:1;
        unsigned char  SREMK0:1;
      };
      struct
      {
        unsigned char  IICMK20:1;
        unsigned char  IICMK21:1;
        unsigned char  :3;
        unsigned char  IICMK00:1;
        unsigned char  IICMK01:1;
        unsigned char  TMMK01H:1;
      };
      struct
      {
        unsigned char  STMK2:1;
        unsigned char  SRMK2:1;
        unsigned char  :3;
        unsigned char  STMK0:1;
        unsigned char  SRMK0:1;
        unsigned char  :1;
      };
    };
  };
} @ 0xFFFE4;

__sfr __no_init volatile union
{
  unsigned short MK1;
  __BITS16       MK1_bit;
  struct
  {
    union
    {
      unsigned char MK1L;
      __BITS8       MK1L_bit;
      struct
      {
        unsigned char  CSIMK10:1;
        unsigned char  CSIMK11:1;
        unsigned char  SREMK1:1;
        unsigned char  IICAMK0:1;
        unsigned char  TMMK00:1;
        unsigned char  TMMK01:1;
        unsigned char  TMMK02:1;
        unsigned char  TMMK03:1;
      };
      struct
      {
        unsigned char  IICMK10:1;
        unsigned char  IICMK11:1;
        unsigned char  TMMK03H:1;
        unsigned char  :5;
      };
      struct
      {
        unsigned char  STMK1:1;
        unsigned char  SRMK1:1;
        unsigned char  :6;
      };
    };
    union
    {
      unsigned char MK1H;
      __BITS8       MK1H_bit;
      struct
      {
        unsigned char  ADMK:1;
        unsigned char  RTCMK:1;
        unsigned char  ITMK:1;
        unsigned char  KRMK:1;
        unsigned char  :3;
        unsigned char  TMMK04:1;
      };
    };
  };
} @ 0xFFFE6;

__sfr __no_init volatile union
{
  unsigned short PR00;
  __BITS16       PR00_bit;
  struct
  {
    union
    {
      unsigned char PR00L;
      __BITS8       PR00L_bit;
      struct
      {
        unsigned char  WDTIPR0:1;
        unsigned char  LVIPR0:1;
        unsigned char  PPR00:1;
        unsigned char  PPR01:1;
        unsigned char  PPR02:1;
        unsigned char  PPR03:1;
        unsigned char  PPR04:1;
        unsigned char  PPR05:1;
      };
    };
    union
    {
      unsigned char PR00H;
      __BITS8       PR00H_bit;
      struct
      {
        unsigned char  CSIPR020:1;
        unsigned char  CSIPR021:1;
        unsigned char  SREPR02:1;
        unsigned char  DMAPR00:1;
        unsigned char  DMAPR01:1;
        unsigned char  CSIPR000:1;
        unsigned char  CSIPR001:1;
        unsigned char  SREPR00:1;
      };
      struct
      {
        unsigned char  IICPR020:1;
        unsigned char  IICPR021:1;
        unsigned char  :3;
        unsigned char  IICPR000:1;
        unsigned char  IICPR001:1;
        unsigned char  TMPR001H:1;
      };
      struct
      {
        unsigned char  STPR02:1;
        unsigned char  SRPR02:1;
        unsigned char  :3;
        unsigned char  STPR00:1;
        unsigned char  SRPR00:1;
        unsigned char  :1;
      };
    };
  };
} @ 0xFFFE8;

__sfr __no_init volatile union
{
  unsigned short PR01;
  __BITS16       PR01_bit;
  struct
  {
    union
    {
      unsigned char PR01L;
      __BITS8       PR01L_bit;
      struct
      {
        unsigned char  CSIPR010:1;
        unsigned char  CSIPR011:1;
        unsigned char  SREPR01:1;
        unsigned char  IICAPR00:1;
        unsigned char  TMPR000:1;
        unsigned char  TMPR001:1;
        unsigned char  TMPR002:1;
        unsigned char  TMPR003:1;
      };
      struct
      {
        unsigned char  IICPR010:1;
        unsigned char  IICPR011:1;
        unsigned char  TMPR003H:1;
        unsigned char  :5;
      };
      struct
      {
        unsigned char  STPR01:1;
        unsigned char  SRPR01:1;
        unsigned char  :6;
      };
    };
    union
    {
      unsigned char PR01H;
      __BITS8       PR01H_bit;
      struct
      {
        unsigned char  ADPR0:1;
        unsigned char  RTCPR0:1;
        unsigned char  ITPR0:1;
        unsigned char  KRPR0:1;
        unsigned char  :3;
        unsigned char  TMPR004:1;
      };
    };
  };
} @ 0xFFFEA;

__sfr __no_init volatile union
{
  unsigned short PR10;
  __BITS16       PR10_bit;
  struct
  {
    union
    {
      unsigned char PR10L;
      __BITS8       PR10L_bit;
      struct
      {
        unsigned char  WDTIPR1:1;
        unsigned char  LVIPR1:1;
        unsigned char  PPR10:1;
        unsigned char  PPR11:1;
        unsigned char  PPR12:1;
        unsigned char  PPR13:1;
        unsigned char  PPR14:1;
        unsigned char  PPR15:1;
      };
    };
    union
    {
      unsigned char PR10H;
      __BITS8       PR10H_bit;
      struct
      {
        unsigned char  CSIPR120:1;
        unsigned char  CSIPR121:1;
        unsigned char  SREPR12:1;
        unsigned char  DMAPR10:1;
        unsigned char  DMAPR11:1;
        unsigned char  CSIPR100:1;
        unsigned char  CSIPR101:1;
        unsigned char  SREPR10:1;
      };
      struct
      {
        unsigned char  IICPR120:1;
        unsigned char  IICPR121:1;
        unsigned char  :3;
        unsigned char  IICPR100:1;
        unsigned char  IICPR101:1;
        unsigned char  TMPR101H:1;
      };
      struct
      {
        unsigned char  STPR12:1;
        unsigned char  SRPR12:1;
        unsigned char  :3;
        unsigned char  STPR10:1;
        unsigned char  SRPR10:1;
        unsigned char  :1;
      };
    };
  };
} @ 0xFFFEC;

